# Audit Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
OpenOptions..::..Audit Property
OpenOptions Class See Also
---
Specifies whether to expand all elements in order to check for corruption.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2014
# Syntax
C#
---
```text
public bool Audit { get; set; }
```

Visual Basic
---
```text
Public Property Audit As Boolean
	Get
	Set
```

Visual C++
---
```text
public:
property bool Audit {
	bool get ();
	void set (bool value);
}
```

# Remarks
The default is false. Setting this to true will increase the time and memory required to open the file.
# See Also
OpenOptions Class
Autodesk.Revit.DB Namespace